Revit 2027 API
ThermalAsset.LiquidViscosity Property
 The liquid viscosity of the asset.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double LiquidViscosity { get; set; }
Public Property LiquidViscosity As Double
	Get
	Set
public:
property double LiquidViscosity {
	double get ();
	void set (double value);
}
member LiquidViscosity : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The given value for liquidViscosity must be non-negative.
InapplicableDataException |  When setting this property: the asset must be liquid to set this property.
Remarks
 Values are in kilograms per feet-second (kg/(ft · s)) and must be non-negative.
See Also
Reference
ThermalAsset Class
Autodesk.Revit.DB Namespace